tests/6_Case_Type_Scatter_Height_20_Dist_20_dir_40_notstarted/30/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
        version 2.0;
        format ascii;
        class dictionary;
        location system;
        object blockMeshDict;
}
convertToMeters 1;

vertices
(
(1989.319 -502.289 0.001)
(-1428.019 1470.712 0.001)
(-2090.468 323.318 0.001)
(1326.871 -1649.684 0.001)
(1989.319 -502.289 120.001)
(-1428.019 1470.712 120.001)
(-2090.468 323.318 120.001)
(1326.871 -1649.684 120.001)
);
blocks
(
        hex (0 1 2 3 4 5 6 7) (157 52 4) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
        inlet
{
        type patch;
        faces
        (
                (0 1 4 5)
        );
}
        outlet
{
        type patch;
        faces
        (
                (2 3 6 7)
        );
}
        ground
{
        type wall;
        faces
        (
                (0 1 2 3)
        );
}
        frontAndBack
{
        type patch;
        faces
        (
                        (1 2 5 6)
                        (0 3 4 7)
                        (4 5 6 7)
        );
}
);
        